In [1]:
import pandas as pd
import ast
from sqlalchemy import create_engine

In [2]:
#Extract

url = "tmdb-movie-metadata/tmdb_5000_credits.csv"

credits_df = pd.read_csv(url)
credits_df.head()

,movie_id,title,cast,crew
0,19995,Avatar,"[{""cast_id"": 242, ""character"": ""Jake Sully"", ""...","[{""credit_id"": ""52fe48009251416c750aca23"", ""de..."
1,285,Pirates of the Caribbean: At World's End,"[{""cast_id"": 4, ""character"": ""Captain Jack Spa...","[{""credit_id"": ""52fe4232c3a36847f800b579"", ""de..."
2,206647,Spectre,"[{""cast_id"": 1, ""character"": ""James Bond"", ""cr...","[{""credit_id"": ""54805967c3a36829b5002c41"", ""de..."
3,49026,The Dark Knight Rises,"[{""cast_id"": 2, ""character"": ""Bruce Wayne / Ba...","[{""credit_id"": ""52fe4781c3a36847f81398c3"", ""de..."
4,49529,John Carter,"[{""cast_id"": 5, ""character"": ""John Carter"", ""c...","[{""credit_id"": ""52fe479ac3a36847f813eaa3"", ""de..."

In [3]:
url = "tmdb-movie-metadata/tmdb_5000_movies.csv"

movies_df = pd.read_csv(url)
movies_df.head()

,budget,genres,homepage,id,keywords,original_language,original_title,overview,popularity,production_companies,production_countries,release_date,revenue,runtime,spoken_languages,status,tagline,title,vote_average,vote_count
0,237000000,"[{""id"": 28, ""name"": ""Action""}, {""id"": 12, ""nam...",http://www.avatarmovie.com/,19995,"[{""id"": 1463, ""name"": ""culture clash""}, {""id"":...",en,Avatar,"In the 22nd century, a paraplegic Marine is di...",150.437577,"[{""name"": ""Ingenious Film Partners"", ""id"": 289...","[{""iso_3166_1"": ""US"", ""name"": ""United States o...",2009-12-10,2787965087,162.0,"[{""iso_639_1"": ""en"", ""name"": ""English""}, {""iso...",Released,Enter the World of Pandora.,Avatar,7.2,11800
1,300000000,"[{""id"": 12, ""name"": ""Adventure""}, {""id"": 14, ""...",http://disney.go.com/disneypictures/pirates/,285,"[{""id"": 270, ""name"": ""ocean""}, {""id"": 726, ""na...",en,Pirates of the Caribbean: At World's End,"Captain Barbossa, long believed to be dead, ha...",139.082615,"[{""name"": ""Walt Disney Pictures"", ""id"": 2}, {""...","[{""iso_3166_1"": ""US"", ""name"": ""United States o...",2007-05-19,961000000,169.0,"[{""iso_639_1"": ""en"", ""name"": ""English""}]",Released,"At the end of the world, the adventure begins.",Pirates of the Caribbean: At World's End,6.9,4500
2,245000000,"[{""id"": 28, ""name"": ""Action""}, {""id"": 12, ""nam...",http://www.sonypictures.com/movies/spectre/,206647,"[{""id"": 470, ""name"": ""spy""}, {""id"": 818, ""name...",en,Spectre,A cryptic message from Bond’s past sends him o...,107.376788,"[{""name"": ""Columbia Pictures"", ""id"": 5}, {""nam...","[{""iso_3166_1"": ""GB"", ""name"": ""United Kingdom""...",2015-10-26,880674609,148.0,"[{""iso_639_1"": ""fr"", ""name"": ""Fran\u00e7ais""},...",Released,A Plan No One Escapes,Spectre,6.3,4466
3,250000000,"[{""id"": 28, ""name"": ""Action""}, {""id"": 80, ""nam...",http://www.thedarkknightrises.com/,49026,"[{""id"": 849, ""name"": ""dc comics""}, {""id"": 853,...",en,The Dark Knight Rises,Following the death of District Attorney Harve...,112.312950,"[{""name"": ""Legendary Pictures"", ""id"": 923}, {""...","[{""iso_3166_1"": ""US"", ""name"": ""United States o...",2012-07-16,1084939099,165.0,"[{""iso_639_1"": ""en"", ""name"": ""English""}]",Released,The Legend Ends,The Dark Knight Rises,7.6,9106
4,260000000,"[{""id"": 28, ""name"": ""Action""}, {""id"": 12, ""nam...",http://movies.disney.com/john-carter,49529,"[{""id"": 818, ""name"": ""based on novel""}, {""id"":...",en,John Carter,"John Carter is a war-weary, former military ca...",43.926995,"[{""name"": ""Walt Disney Pictures"", ""id"": 2}]","[{""iso_3166_1"": ""US"", ""name"": ""United States o...",2012-03-07,284139100,132.0,"[{""iso_639_1"": ""en"", ""name"": ""English""}]",Released,"Lost in our world, found in another.",John Carter,6.1,2124

In [4]:
#Transform

cast = []
character = []
movie_id = []

for x in range(len(credits_df["cast"])):
    
    for y in range(len(ast.literal_eval(credits_df.loc[x, "cast"]))):
        movie_id.append(credits_df.loc[x, "movie_id"])
        cast.append(ast.literal_eval(credits_df.loc[x, "cast"])[y]["name"])
        character.append(ast.literal_eval(credits_df.loc[x, "cast"])[y]["character"])

In [5]:
cast_df = pd.DataFrame({"id": movie_id,
                       "character": character,
                       "cast_name": cast})
cast_df.head()

      id            character           cast_name
0  19995           Jake Sully     Sam Worthington
1  19995              Neytiri         Zoe Saldana
2  19995  Dr. Grace Augustine    Sigourney Weaver
3  19995        Col. Quaritch        Stephen Lang
4  19995         Trudy Chacon  Michelle Rodriguez

In [4]:
crew = []
department = []
job = []
movie_id = []

for x in range(len(credits_df["crew"])):
    
    for y in range(len(ast.literal_eval(credits_df.loc[x, "crew"]))):
        movie_id.append(credits_df.loc[x, "movie_id"])
        department.append(ast.literal_eval(credits_df.loc[x, "crew"])[y]["department"])
        job.append(ast.literal_eval(credits_df.loc[x, "crew"])[y]["job"])
        crew.append(ast.literal_eval(credits_df.loc[x, "crew"])[y]["name"])

In [5]:
crew_df = pd.DataFrame({"id": movie_id,
                       "department": department,
                       "job": job,
                       "crew_name": crew})
crew_df.head()

      id  department                       job          crew_name
0  19995     Editing                    Editor  Stephen E. Rivkin
1  19995         Art         Production Design        Rick Carter
2  19995       Sound            Sound Designer  Christopher Boyes
3  19995       Sound  Supervising Sound Editor  Christopher Boyes
4  19995  Production                   Casting          Mali Finn

In [6]:
genre = []
movie_id = []

for x in range(len(movies_df["genres"])):
    
    for y in range(len(ast.literal_eval(movies_df.loc[x, "genres"]))):
        movie_id.append(movies_df.loc[x, "id"])
        genre.append(ast.literal_eval(movies_df.loc[x, "genres"])[y]["name"])

In [7]:
genre_df = pd.DataFrame({"id": movie_id,
                        "genre": genre})
genre_df.head()

      id            genre
0  19995           Action
1  19995        Adventure
2  19995          Fantasy
3  19995  Science Fiction
4    285        Adventure

In [8]:
companies = []
movie_id = []

for x in range(len(movies_df["production_companies"])):
    
    for y in range(len(ast.literal_eval(movies_df.loc[x, "production_companies"]))):
        movie_id.append(movies_df.loc[x, "id"])
        companies.append(ast.literal_eval(movies_df.loc[x, "production_companies"])[y]["name"])

In [9]:
production_companies_df = pd.DataFrame({"id": movie_id,
                                       "production_company": companies})
production_companies_df.head()

      id                      production_company
0  19995                 Ingenious Film Partners
1  19995  Twentieth Century Fox Film Corporation
2  19995                      Dune Entertainment
3  19995                Lightstorm Entertainment
4    285                    Walt Disney Pictures

In [10]:
country = []
movie_id = []

for x in range(len(movies_df["production_countries"])):
    
    for y in range(len(ast.literal_eval(movies_df.loc[x, "production_countries"]))):
        movie_id.append(movies_df.loc[x, "id"])
        country.append(ast.literal_eval(movies_df.loc[x, "production_countries"])[y]["name"])

In [11]:
production_countries_df = pd.DataFrame({"id": movie_id,
                                       "country": country})
production_countries_df.head()

       id                   country
0   19995  United States of America
1   19995            United Kingdom
2     285  United States of America
3  206647            United Kingdom
4  206647  United States of America

In [12]:
languages = []
movie_id = []

for x in range(len(movies_df["spoken_languages"])):
    
    for y in range(len(ast.literal_eval(movies_df.loc[x, "spoken_languages"]))):
        movie_id.append(movies_df.loc[x, "id"])
        languages.append(ast.literal_eval(movies_df.loc[x, "spoken_languages"])[y]["iso_639_1"])

In [13]:
spoken_languages_df = pd.DataFrame({"id": movie_id,
                                   "spoken_languages": languages})
spoken_languages_df.head()

       id spoken_languages
0   19995               en
1   19995               es
2     285               en
3  206647               fr
4  206647               en

In [14]:
movies_df.drop(columns=["genres", "keywords", "original_title", "production_companies", "production_countries",
                        "spoken_languages", "status"], 
               axis=1, inplace=True)
movies_df = movies_df.set_index("id")
movies_df.head()

,budget,homepage,original_language,overview,popularity,release_date,revenue,runtime,tagline,title,vote_average,vote_count
id,,,,,,,,,,,,
19995,237000000,http://www.avatarmovie.com/,en,"In the 22nd century, a paraplegic Marine is di...",150.437577,2009-12-10,2787965087,162.0,Enter the World of Pandora.,Avatar,7.2,11800
285,300000000,http://disney.go.com/disneypictures/pirates/,en,"Captain Barbossa, long believed to be dead, ha...",139.082615,2007-05-19,961000000,169.0,"At the end of the world, the adventure begins.",Pirates of the Caribbean: At World's End,6.9,4500
206647,245000000,http://www.sonypictures.com/movies/spectre/,en,A cryptic message from Bond’s past sends him o...,107.376788,2015-10-26,880674609,148.0,A Plan No One Escapes,Spectre,6.3,4466
49026,250000000,http://www.thedarkknightrises.com/,en,Following the death of District Attorney Harve...,112.312950,2012-07-16,1084939099,165.0,The Legend Ends,The Dark Knight Rises,7.6,9106
49529,260000000,http://movies.disney.com/john-carter,en,"John Carter is a war-weary, former military ca...",43.926995,2012-03-07,284139100,132.0,"Lost in our world, found in another.",John Carter,6.1,2124

In [15]:
# Load

from config import username, password
connection_string = f"postgres://{username}:{password}@localhost:5432/movies_db"
engine = create_engine(connection_string)

In [16]:
engine.table_names()

['tmdb_cast',
 'tmdb_crew',
 'tmdb_genre',
 'tmdb_production_companies',
 'tmdb_production_countries',
 'tmdb_spoken_languages',
 'fmld_genre',
 'fmld_movies',
 'fmld_cast',
 'fmld_crew',
 'fmld_production_companies',
 'fmld_production_countries',
 'fmld_spoken_languages',
 'tmdb_movies']

In [28]:
movies_df.to_sql(con=engine, name="tmdb_movies", if_exists="append", index=True)

In [29]:
cast_df.to_sql(con=engine, name="tmdb_cast", if_exists="append", index=False)

In [30]:
crew_df.to_sql(con=engine, name="tmdb_crew", if_exists="append", index=False)

In [32]:
genre_df.to_sql(con=engine, name="tmdb_genre", if_exists="append", index=False)

In [33]:
production_companies_df.to_sql(con=engine, name="tmdb_production_companies", if_exists="append", index=False)

In [34]:
production_countries_df.to_sql(con=engine, name="tmdb_production_countries", if_exists="append", index=False)

In [35]:
spoken_languages_df.to_sql(con=engine, name="tmdb_spoken_languages", if_exists="append", index=False)

In [17]:
movies_df.to_csv("data/tmdb_movies.csv", index=True)

cast_df.to_csv("data/tmdb_cast.csv", index=False)

crew_df.to_csv("data/tmdb_crew.csv", index=False)

genre_df.to_csv("data/tmdb_genre.csv", index=False)

production_companies_df.to_csv("data/tmdb_production_companies.csv", index=False)

production_countries_df.to_csv("data/tmdb_production_countries.csv", index=False)

spoken_languages_df.to_csv("data/tmdb_spoken_languages.csv", index=False)

NameError: name 'cast_df' is not defined